app/controllers/users_controller.rb

UPDATE "users" SET "name" = 'Alice', "updated_at" = '2025-11-14 14:56:03.985824' WHERE "users"."id" = 1
---
  def update
    if @user.update(user_params)